{"backend": "tensorflow", "keras_version": "2.1.5", "config": [{"config": {"name": "dense_25", "trainable": true, "dtype": "float32", "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "batch_input_shape": [null, 4], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 500}, "class_name": "Dense"}, {"config": {"name": "dense_26", "trainable": true, "use_bias": true, "units": 500, "kernel_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_27", "trainable": true, "use_bias": true, "units": 400, "kernel_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_28", "trainable": true, "use_bias": true, "units": 400, "kernel_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_29", "trainable": true, "use_bias": true, "units": 300, "kernel_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_30", "trainable": true, "use_bias": true, "units": 3, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}