{"backend": "tensorflow", "config": [{"config": {"kernel_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "dtype": "float32", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "batch_input_shape": [null, 4], "units": 500, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "sigmoid", "name": "dense_2", "bias_regularizer": null, "units": 500, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "sigmoid", "name": "dense_3", "bias_regularizer": null, "units": 400, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "sigmoid", "name": "dense_4", "bias_regularizer": null, "units": 400, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "sigmoid", "name": "dense_5", "bias_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "name": "dense_6", "bias_regularizer": null, "units": 3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.5"}