{"backend": "tensorflow", "config": [{"config": {"units": 100, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 4], "activity_regularizer": null, "dtype": "float32", "activation": "sigmoid", "name": "dense_1"}, "class_name": "Dense"}, {"config": {"units": 500, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "name": "dense_2"}, "class_name": "Dense"}, {"config": {"units": 400, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "name": "dense_3"}, "class_name": "Dense"}, {"config": {"units": 300, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "name": "dense_4"}, "class_name": "Dense"}, {"config": {"units": 200, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "name": "dense_5"}, "class_name": "Dense"}, {"config": {"units": 3, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "dense_6"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.5"}